
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.et-pet-api-redis-url
  * azurerm_key_vault_secret.redis6_access_key
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.etapi-redis.azurerm_private_endpoint.this[0]
  * module.etapi-redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et-pet-api-redis-url will be updated in-place
  ~ resource "azurerm_key_vault_secret" "et-pet-api-redis-url" {
        id                      = "https://et-pet-aat.vault.azure.net/secrets/et-pet-api-redis-url/b6102fcd41ec4fadaf001df8a0f389f9"
        name                    = "et-pet-api-redis-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis6_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis6_access_key" {
        id                      = "https://et-pet-aat.vault.azure.net/secrets/etapi-redis-access-key/12313ef1d3934928a88af8b38113b90e"
        name                    = "etapi-redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat|et-pet-aat"
        name                           = "et-pet-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.etapi-redis.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Network/privateEndpoints/et-pet-aat" -> (known after apply)
        name                     = "et-pet-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Network/networkInterfaces/et-pet-aat.nic.b3f035d6-eb07-43a9-a10e-03159e069d6a"
              - name = "et-pet-aat.nic.b3f035d6-eb07-43a9-a10e-03159e069d6a"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Network/privateEndpoints/et-pet-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "et-pet-api-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.27",
                        ]
                      - name         = "et-pet-api-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Network/privateEndpoints/et-pet-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "et-pet-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Cache/redis/et-pet-api-aat" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.27" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.etapi-redis.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "et-pet-api-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Cache/redis/et-pet-api-aat" -> (known after apply)
        name                          = "et-pet-api-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Vars":{}} -->